In [57]:
import numpy as np
import pandas as pd

In [58]:
df1 = pd.DataFrame([['송중기', 92, 82], ['권보아', 89, 91], ['김나현', 71, 89],['박효신', 90, 78]],\
                   columns=['이름', '영어', '국어'])
df2 = df1.copy()
df3 = df1.copy()
df4 = df1.copy()

In [59]:
df1['반'] = 1
df1['참여'] = '참석'
df1['학점'] = ['A', 'B', 'C', 'A']
df1['평균'] = (df1['영어'] + df1['국어']) / 2
df1.loc[4] = ['아무게', 30, 23, 1, '불참', 'F', np.nan]
df1
# df1.loc[4]

    이름  영어  국어  반  참여 학점    평균
0  송중기  92  82  1  참석  A  87.0
1  권보아  89  91  1  참석  B  90.0
2  김나현  71  89  1  참석  C  80.0
3  박효신  90  78  1  참석  A  84.0
4  아무게  30  23  1  불참  F   NaN

In [60]:
df1.loc[4]

이름    아무게
영어     30
국어     23
반       1
참여     불참
학점      F
평균    NaN
Name: 4, dtype: object

In [61]:
df1.iloc[4]

이름    아무게
영어     30
국어     23
반       1
참여     불참
학점      F
평균    NaN
Name: 4, dtype: object

In [62]:
df2['반'] = 2
df2

    이름  영어  국어  반
0  송중기  92  82  2
1  권보아  89  91  2
2  김나현  71  89  2
3  박효신  90  78  2

In [63]:
df2.iloc[:, -1:]

   반
0  2
1  2
2  2
3  2

In [64]:
df2.iloc[:, :-1]

    이름  영어  국어
0  송중기  92  82
1  권보아  89  91
2  김나현  71  89
3  박효신  90  78

In [65]:
pd.concat((df2.iloc[:, :-1], df2.iloc[:, -1:]), axis=1)

    이름  영어  국어  반
0  송중기  92  82  2
1  권보아  89  91  2
2  김나현  71  89  2
3  박효신  90  78  2

In [66]:
df3.insert(0, '반', 1)
df3

   반   이름  영어  국어
0  1  송중기  92  82
1  1  권보아  89  91
2  1  김나현  71  89
3  1  박효신  90  78